import pandas as pd

df = pd.read_csv("data/work_data.csv")
df["実施日時"] = pd.to_datetime(df["実施日時"])

print(df.shape)
print(df.info())
print(df.dtypes)
print(df.head())
print("------------------------------------")
print("最新実施日時：" + str(df["実施日時"].min()))
print("最古実施日時：" + str(df["実施日時"].max()))
print(df.isnull().sum())
print("------------------------------------")
print("------------------------------------")
print("作業名の分布")
print("------------------------------------")
print(df["作業名"].value_counts())
print("------------------------------------")
print("工程別の平均作業時間")
print("------------------------------------")
print(df.groupby("工程")["作業時間"].mean())
print("------------------------------------")
print("工程別修正回数")
print("------------------------------------")
print(df.groupby("工程")["修正回数"].sum())
print("------------------------------------")
print("9/1〜9/10のデータ期間内の総作業時間")
print("------------------------------------")
print(df.groupby("工程")["作業時間"].agg(["sum", "mean"]).sort_values(by="sum", ascending=False))
print("------------------------------------")
print("工程別表")
print("------------------------------------")
print(df.groupby("工程").agg(
    発生回数=("工程", "count"),
    総作業時間=("作業時間", "sum"),
    平均作業時間=("作業時間", "mean"),
    総修正回数=("修正回数", "sum"),
    平均修正回数=("修正回数", "mean")
    ))

print("------------------------------------")
print("------------------------------------")
工程別表 = df.groupby("工程").agg(
    発生回数=("工程", "count"),
    総作業時間=("作業時間", "sum"),
    平均作業時間=("作業時間", "mean"),
    総修正回数=("修正回数", "sum"),
    平均修正回数=("修正回数", "mean")
)
工程別表["時間負荷スコア"] = (
    工程別表["総作業時間"] / 工程別表["総作業時間"].max()
)

工程別表["修正負荷スコア"] = (
    工程別表["総修正回数"] / 工程別表["総修正回数"].max()
)
工程別表["自動化候補スコア"] = (
    工程別表["時間負荷スコア"] * 0.5
    + 工程別表["修正負荷スコア"] * 0.5
)
print(
    工程別表.sort_values(
        "自動化候補スコア",
        ascending=False
    )
)

print("------------------------------------")
print("1回あたりの修正負荷")
print("------------------------------------")